project/atropos-c/cases/mysql-cases/concurrency-case/front_1/parties-4.log
sysbench 1.1.0-f698960 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 1.000000 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 1.0s ] thds: 4 tps: 23.88 qps: 547.34 (r/w/o: 390.11/105.49/51.75) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 2.0s ] thds: 4 tps: 8.01 qps: 157.18 (r/w/o: 112.13/29.03/16.02) lat (ms,95%): 1013.60 err/s: 0.00 reconn/s: 0.00
[ 3.0s ] thds: 4 tps: 6.98 qps: 139.53 (r/w/o: 97.67/27.91/13.95) lat (ms,95%): 2198.52 err/s: 0.00 reconn/s: 0.00
[ 4.0s ] thds: 4 tps: 10.00 qps: 203.03 (r/w/o: 140.02/43.01/20.00) lat (ms,95%): 2362.72 err/s: 0.00 reconn/s: 0.00
[ 5.0s ] thds: 4 tps: 30.00 qps: 595.05 (r/w/o: 420.03/115.01/60.00) lat (ms,95%): 2120.76 err/s: 0.00 reconn/s: 0.00
[ 6.0s ] thds: 4 tps: 30.00 qps: 593.98 (r/w/o: 416.99/117.00/60.00) lat (ms,95%): 569.67 err/s: 0.00 reconn/s: 0.00
[ 7.0s ] thds: 4 tps: 48.20 qps: 971.10 (r/w/o: 676.86/197.83/96.41) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 8.0s ] thds: 4 tps: 82.67 qps: 1647.45 (r/w/o: 1152.42/329.69/165.34) lat (ms,95%): 70.55 err/s: 0.00 reconn/s: 0.00
[ 9.0s ] thds: 4 tps: 80.31 qps: 1607.23 (r/w/o: 1128.38/318.23/160.62) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 10.0s ] thds: 4 tps: 44.00 qps: 871.98 (r/w/o: 610.98/173.00/88.00) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 11.0s ] thds: 4 tps: 44.00 qps: 890.03 (r/w/o: 620.02/182.01/88.00) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 12.0s ] thds: 4 tps: 45.94 qps: 921.72 (r/w/o: 641.11/188.74/91.87) lat (ms,95%): 282.25 err/s: 0.00 reconn/s: 0.00
[ 13.0s ] thds: 4 tps: 65.82 qps: 1313.36 (r/w/o: 925.44/256.29/131.64) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 14.0s ] thds: 4 tps: 65.01 qps: 1290.10 (r/w/o: 900.07/260.02/130.01) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 15.0s ] thds: 4 tps: 51.17 qps: 1004.34 (r/w/o: 699.33/202.67/102.34) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 16.0s ] thds: 4 tps: 47.99 qps: 989.74 (r/w/o: 698.81/194.95/95.97) lat (ms,95%): 118.92 err/s: 0.00 reconn/s: 0.00
[ 17.0s ] thds: 4 tps: 52.05 qps: 1032.02 (r/w/o: 722.71/205.20/104.10) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 18.0s ] thds: 4 tps: 62.75 qps: 1250.93 (r/w/o: 870.47/254.97/125.49) lat (ms,95%): 121.08 err/s: 0.00 reconn/s: 0.00
[ 19.0s ] thds: 4 tps: 40.07 qps: 801.48 (r/w/o: 563.04/158.29/80.15) lat (ms,95%): 277.21 err/s: 0.00 reconn/s: 0.00
[ 20.0s ] thds: 4 tps: 60.14 qps: 1215.79 (r/w/o: 851.96/243.56/120.28) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 21.0s ] thds: 4 tps: 55.77 qps: 1107.36 (r/w/o: 772.76/223.07/111.53) lat (ms,95%): 186.54 err/s: 0.00 reconn/s: 0.00
[ 22.0s ] thds: 4 tps: 54.15 qps: 1091.03 (r/w/o: 769.13/213.59/108.30) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 23.0s ] thds: 4 tps: 45.90 qps: 913.04 (r/w/o: 637.63/183.61/91.80) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 24.0s ] thds: 4 tps: 47.97 qps: 969.42 (r/w/o: 676.59/196.88/95.94) lat (ms,95%): 147.61 err/s: 0.00 reconn/s: 0.00
[ 25.0s ] thds: 4 tps: 60.17 qps: 1201.48 (r/w/o: 842.44/238.69/120.35) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 26.0s ] thds: 4 tps: 50.03 qps: 983.56 (r/w/o: 685.39/198.11/100.06) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 27.0s ] thds: 4 tps: 44.87 qps: 906.42 (r/w/o: 638.19/178.49/89.74) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 28.0s ] thds: 4 tps: 52.07 qps: 1026.45 (r/w/o: 716.01/206.29/104.15) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 29.0s ] thds: 4 tps: 37.98 qps: 761.63 (r/w/o: 535.74/149.93/75.96) lat (ms,95%): 231.53 err/s: 0.00 reconn/s: 0.00
[ 30.0s ] thds: 4 tps: 49.07 qps: 992.46 (r/w/o: 694.02/200.29/98.14) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 31.0s ] thds: 4 tps: 32.90 qps: 654.01 (r/w/o: 453.62/134.59/65.80) lat (ms,95%): 308.84 err/s: 0.00 reconn/s: 0.00
[ 32.0s ] thds: 4 tps: 48.18 qps: 967.71 (r/w/o: 678.60/192.74/96.37) lat (ms,95%): 350.33 err/s: 0.00 reconn/s: 0.00
[ 33.0s ] thds: 4 tps: 43.86 qps: 868.23 (r/w/o: 612.04/168.46/87.72) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 34.0s ] thds: 4 tps: 41.97 qps: 844.36 (r/w/o: 588.55/171.87/83.94) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 35.0s ] thds: 4 tps: 46.20 qps: 936.97 (r/w/o: 657.78/186.79/92.39) lat (ms,95%): 158.63 err/s: 0.00 reconn/s: 0.00
[ 36.0s ] thds: 4 tps: 44.95 qps: 887.95 (r/w/o: 619.27/178.79/89.89) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 37.0s ] thds: 4 tps: 43.01 qps: 854.28 (r/w/o: 601.20/167.06/86.03) lat (ms,95%): 219.36 err/s: 0.00 reconn/s: 0.00
[ 38.0s ] thds: 4 tps: 44.85 qps: 901.04 (r/w/o: 631.92/179.41/89.71) lat (ms,95%): 170.48 err/s: 0.00 reconn/s: 0.00
[ 39.0s ] thds: 4 tps: 53.14 qps: 1061.88 (r/w/o: 741.01/214.58/106.29) lat (ms,95%): 142.39 err/s: 0.00 reconn/s: 0.00
[ 40.0s ] thds: 4 tps: 44.00 qps: 892.02 (r/w/o: 623.01/181.00/88.00) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 41.0s ] thds: 4 tps: 42.06 qps: 831.19 (r/w/o: 579.83/167.24/84.12) lat (ms,95%): 303.33 err/s: 0.00 reconn/s: 0.00
[ 42.0s ] thds: 4 tps: 35.85 qps: 726.03 (r/w/o: 510.91/143.41/71.71) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 43.0s ] thds: 4 tps: 41.13 qps: 828.66 (r/w/o: 578.86/167.54/82.26) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 44.0s ] thds: 4 tps: 48.86 qps: 974.16 (r/w/o: 682.01/194.43/97.71) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 45.0s ] thds: 4 tps: 40.01 qps: 789.29 (r/w/o: 557.21/152.06/80.03) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 46.0s ] thds: 4 tps: 46.15 qps: 929.11 (r/w/o: 645.16/191.64/92.31) lat (ms,95%): 196.89 err/s: 0.00 reconn/s: 0.00
[ 47.0s ] thds: 4 tps: 49.85 qps: 996.08 (r/w/o: 700.95/195.43/99.71) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 48.0s ] thds: 4 tps: 49.95 qps: 975.94 (r/w/o: 678.27/197.79/99.89) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 49.0s ] thds: 4 tps: 46.04 qps: 934.77 (r/w/o: 656.54/186.15/92.08) lat (ms,95%): 161.51 err/s: 0.00 reconn/s: 0.00
[ 50.0s ] thds: 4 tps: 30.05 qps: 605.91 (r/w/o: 419.63/126.19/60.09) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 51.0s ] thds: 4 tps: 43.02 qps: 869.34 (r/w/o: 613.24/170.07/86.03) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 52.0s ] thds: 4 tps: 43.99 qps: 873.87 (r/w/o: 608.91/176.97/87.99) lat (ms,95%): 155.80 err/s: 0.00 reconn/s: 0.00
[ 53.0s ] thds: 4 tps: 44.90 qps: 889.99 (r/w/o: 628.58/171.61/89.80) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 54.0s ] thds: 4 tps: 36.09 qps: 733.77 (r/w/o: 511.23/150.36/72.17) lat (ms,95%): 173.58 err/s: 0.00 reconn/s: 0.00
[ 55.0s ] thds: 4 tps: 46.90 qps: 937.03 (r/w/o: 658.61/184.61/93.80) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 56.0s ] thds: 4 tps: 39.06 qps: 775.13 (r/w/o: 542.79/154.22/78.11) lat (ms,95%): 211.60 err/s: 0.00 reconn/s: 0.00
[ 57.0s ] thds: 4 tps: 39.92 qps: 794.38 (r/w/o: 553.87/160.67/79.84) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 58.0s ] thds: 4 tps: 45.11 qps: 889.11 (r/w/o: 616.46/182.43/90.21) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 59.0s ] thds: 4 tps: 36.06 qps: 739.31 (r/w/o: 522.93/144.26/72.13) lat (ms,95%): 356.70 err/s: 0.00 reconn/s: 0.00
[ 60.0s ] thds: 4 tps: 33.85 qps: 688.01 (r/w/o: 476.93/143.38/67.71) lat (ms,95%): 114.72 err/s: 0.00 reconn/s: 0.00
[ 61.0s ] thds: 4 tps: 33.06 qps: 657.12 (r/w/o: 463.79/127.22/66.11) lat (ms,95%): 719.92 err/s: 0.00 reconn/s: 0.00
[ 62.0s ] thds: 4 tps: 47.95 qps: 942.11 (r/w/o: 659.38/186.82/95.91) lat (ms,95%): 235.74 err/s: 0.00 reconn/s: 0.00
[ 63.0s ] thds: 4 tps: 44.14 qps: 884.89 (r/w/o: 619.02/177.58/88.29) lat (ms,95%): 200.47 err/s: 0.00 reconn/s: 0.00
[ 64.0s ] thds: 4 tps: 42.94 qps: 867.74 (r/w/o: 610.11/171.75/85.88) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 65.0s ] thds: 4 tps: 42.07 qps: 849.47 (r/w/o: 594.03/171.30/84.15) lat (ms,95%): 193.38 err/s: 0.00 reconn/s: 0.00
[ 66.0s ] thds: 4 tps: 48.94 qps: 976.87 (r/w/o: 682.21/196.77/97.89) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
[ 67.0s ] thds: 4 tps: 48.06 qps: 956.16 (r/w/o: 666.81/193.23/96.12) lat (ms,95%): 150.29 err/s: 0.00 reconn/s: 0.00
[ 68.0s ] thds: 4 tps: 26.90 qps: 542.90 (r/w/o: 385.51/103.60/53.79) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 69.0s ] thds: 4 tps: 40.14 qps: 794.79 (r/w/o: 549.93/164.58/80.28) lat (ms,95%): 411.96 err/s: 0.00 reconn/s: 0.00
[ 70.0s ] thds: 4 tps: 47.86 qps: 956.29 (r/w/o: 673.09/187.47/95.73) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 71.0s ] thds: 4 tps: 32.97 qps: 649.36 (r/w/o: 455.55/127.87/65.93) lat (ms,95%): 350.33 err/s: 0.00 reconn/s: 0.00
[ 72.0s ] thds: 4 tps: 49.08 qps: 985.53 (r/w/o: 687.06/200.31/98.15) lat (ms,95%): 167.44 err/s: 0.00 reconn/s: 0.00
[ 73.0s ] thds: 4 tps: 42.08 qps: 848.59 (r/w/o: 593.11/171.32/84.16) lat (ms,95%): 207.82 err/s: 0.00 reconn/s: 0.00
[ 74.0s ] thds: 4 tps: 47.03 qps: 924.62 (r/w/o: 649.44/181.12/94.06) lat (ms,95%): 144.97 err/s: 0.00 reconn/s: 0.00
[ 75.0s ] thds: 4 tps: 38.86 qps: 779.24 (r/w/o: 546.06/155.45/77.72) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 76.0s ] thds: 4 tps: 51.97 qps: 1054.44 (r/w/o: 738.61/211.89/103.94) lat (ms,95%): 130.13 err/s: 0.00 reconn/s: 0.00
[ 77.0s ] thds: 4 tps: 49.04 qps: 964.85 (r/w/o: 669.59/197.17/98.09) lat (ms,95%): 164.45 err/s: 0.00 reconn/s: 0.00
[ 78.0s ] thds: 4 tps: 40.07 qps: 824.45 (r/w/o: 581.02/163.29/80.14) lat (ms,95%): 134.90 err/s: 0.00 reconn/s: 0.00
[ 79.0s ] thds: 4 tps: 42.01 qps: 840.13 (r/w/o: 592.09/164.03/84.01) lat (ms,95%): 223.34 err/s: 0.00 reconn/s: 0.00
[ 80.0s ] thds: 4 tps: 42.90 qps: 823.07 (r/w/o: 569.67/167.61/85.80) lat (ms,95%): 204.11 err/s: 0.00 reconn/s: 0.00
[ 81.0s ] thds: 4 tps: 40.14 qps: 825.83 (r/w/o: 577.98/167.57/80.28) lat (ms,95%): 356.70 err/s: 0.00 reconn/s: 0.00
[ 82.0s ] thds: 4 tps: 54.84 qps: 1071.84 (r/w/o: 745.80/216.36/109.68) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 83.0s ] thds: 4 tps: 44.96 qps: 921.10 (r/w/o: 655.36/175.83/89.91) lat (ms,95%): 189.93 err/s: 0.00 reconn/s: 0.00
[ 84.0s ] thds: 4 tps: 48.18 qps: 955.58 (r/w/o: 661.48/197.74/96.36) lat (ms,95%): 153.02 err/s: 0.00 reconn/s: 0.00
[ 85.0s ] thds: 4 tps: 50.02 qps: 1005.35 (r/w/o: 707.25/198.07/100.04) lat (ms,95%): 132.49 err/s: 0.00 reconn/s: 0.00
[ 86.0s ] thds: 4 tps: 54.95 qps: 1095.98 (r/w/o: 766.29/219.80/109.90) lat (ms,95%): 123.28 err/s: 0.00 reconn/s: 0.00
[ 87.0s ] thds: 4 tps: 37.87 qps: 762.43 (r/w/o: 534.20/152.49/75.74) lat (ms,95%): 179.94 err/s: 0.00 reconn/s: 0.00
[ 88.0s ] thds: 4 tps: 41.18 qps: 842.62 (r/w/o: 591.54/168.72/82.35) lat (ms,95%): 344.08 err/s: 0.00 reconn/s: 0.00
[ 89.0s ] thds: 4 tps: 56.84 qps: 1122.93 (r/w/o: 788.85/220.40/113.69) lat (ms,95%): 139.85 err/s: 0.00 reconn/s: 0.00
[ 90.0s ] thds: 4 tps: 39.94 qps: 765.91 (r/w/o: 525.25/160.77/79.89) lat (ms,95%): 215.44 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            56140
        write:                           16040
        other:                           8020
        total:                           80200
    transactions:                        4010   (44.44 per sec.)
    queries:                             80200  (888.88 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      44.4441
    time elapsed:                        90.2256s
    total number of events:              4010

Latency (ms):
         min:                                   23.68
         avg:                                   89.97
         max:                                 2886.04
         95th percentile:                      193.38
         sum:                               360791.47

Threads fairness:
    events (avg/stddev):           1002.5000/21.80
    execution time (avg/stddev):   90.1979/0.02